## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 43 to add, 0 to change, 38 to destroy.</code></pre>

* Create
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;response&#34;]
  * module.shutter.azurerm_cdn_profile.main[&#34;response&#34;]
  * module.shutter.azurerm_storage_account.shutter_store[&#34;response&#34;]
  * module.shutter.azurerm_template_deployment.custom_domain[&#34;response&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;response&#34;]
* Replace
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;adoption&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cft-api-mgmt&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cmc&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;cmc-legal&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-amend&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-da&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-dn&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-pfe&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;div-rfe&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;dtsse-ardoq-adapter&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;et-sya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fact&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fact-admin&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;fees-register&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;gateway-ccd&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;hmi-apim&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;ia-aip&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-user-dashboard&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-web-admin&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;idam-web-public&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;lau&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;manage-payments&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;nfdiv-civil-partnership&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;paybubble&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;payment-outcome&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;pcq&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;plum&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;private-law&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;probate&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;reformscan&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;return-case-doc-ccd&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-cor&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-tribunals&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;sscs-tya&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-approve-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-manage-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-register-org&#34;]
  * module.shutter.null_resource.enable_custom_https_cmd[&#34;xui-webapp&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["response"] will be created
  + resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_compression_enabled        = false
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "westus"
      + name                          = "hmcts-response-shutter-prod"
      + origin_host_header            = (known after apply)
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "hmcts-shutter-response"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "shutter-app-prod-rg"
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = (known after apply)
        }
    }

  # module.shutter.azurerm_cdn_profile.main["response"] will be created
  + resource "azurerm_cdn_profile" "main" {
      + id                  = (known after apply)
      + location            = "westus"
      + name                = "hmcts-shutter-response"
      + resource_group_name = "shutter-app-prod-rg"
      + sku                 = "Standard_Verizon"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.shutter.azurerm_storage_account.shutter_store["response"] will be created
  + resource "azurerm_storage_account" "shutter_store" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "RAGRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = false
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_0"
      + name                              = "hmctsresponseshutterprod"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "shutter-app-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + static_website {
          + error_404_document = "index.html"
          + index_document     = "index.html"
        }
    }

  # module.shutter.azurerm_template_deployment.custom_domain["response"] will be created
  + resource "azurerm_template_deployment" "custom_domain" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "response"
      + outputs             = (known after apply)
      + parameters          = {
          + "hostName" = "response.platform.hmcts.net"
          + "name"     = "hmcts-shutter-response/hmcts-response-shutter-prod/response-platform-hmcts-net"
        }
      + resource_group_name = "shutter-app-prod-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + hostName = {
                      + type = "string"
                    }
                  + name     = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2019-04-15"
                      + name       = "[parameters('name')]"
                      + properties = "[variables('properties')]"
                      + type       = "microsoft.cdn/profiles/endpoints/customdomains"
                    },
                ]
              + variables      = {
                  + properties = {
                      + hostName = "[parameters('hostName')]"
                    }
                }
            }
        )
    }

  # module.shutter.null_resource.enable_custom_https_cmd["adoption"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "6536842450839550082" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "c09c1baeae23480c98036654883e981a" -> "cbf7cc53063242a6a4a932491f8ab15e"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cft-api-mgmt"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "182537284912171849" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "78dbc8f631864cab8f0006dac8d31b9b" -> "fbfc05864a2c414a875e72f671ab4439"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cmc"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "1805323153470211992" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "fee565346a7f4f27b2f0e52390382703" -> "a6a515d7b7ab43788da9e3f6ae315f58"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["cmc-legal"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "238118898828345828" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "cc12febc342b4c3e884191f3047c7ea4" -> "21fe75dd0d8e431e98dd60fa476bcb11"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-amend"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "1240696503753476115" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "ecd4ffda263746468146946f5bcf2188" -> "7bc1e65e516b47f79b02774df2811e7a"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-da"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "9000704637216547474" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "0e867ea2dbe54c6a801ab57def5515a0" -> "55e965f200634d8da0ca92d3aa66267e"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-dn"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "659393841110793055" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "1df0882bc082446297280edff108b458" -> "6387a829bb634768ae97c1b20010bfa9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-pfe"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8961377253244680790" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "0cabe6b84cd64b11ae28dad6c477177b" -> "cadc9e5325794ab7adee28a846391fdb"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["div-rfe"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8246081473172688315" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "194efbc0e76b4101937a789d4d20e142" -> "4bbeb137114c4662a7ebca80a107c75e"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["dtsse-ardoq-adapter"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "6224882098190634208" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "78dbc8f631864cab8f0006dac8d31b9b" -> "fbfc05864a2c414a875e72f671ab4439"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["et-sya"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "4891855578750868051" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "d90d972714f442f09f33f3efc2b37666" -> "c70260f515d24103a9e5e5e99e3e704a"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fact"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "5133691233304189097" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "9d00bfd76fd94d59b792ccddbfef11ed" -> "ba12836b15924161bc546f7516ef3ec1"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fact-admin"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "6661722335982255357" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "9d00bfd76fd94d59b792ccddbfef11ed" -> "ba12836b15924161bc546f7516ef3ec1"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["fees-register"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "5245366680156983898" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "1f8ea5eb6e5d464fb3d3d5e13de4e815" -> "3891315470474817993af3a36eb38986"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["gateway-ccd"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "7620254587249228702" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "c448ac7fc1ad479ba41e8f5229bf8ed0" -> "3a37c778be4140a49012901ca0d661da"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["hmi-apim"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "1948744567687977953" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "78dbc8f631864cab8f0006dac8d31b9b" -> "fbfc05864a2c414a875e72f671ab4439"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["ia-aip"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "383612884347823059" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "9427d4e5db9340898a631dc4359f10d3" -> "6c089471a4de4934a43dc079cdeed355"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-user-dashboard"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "1042442152844046634" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "f7c6532bab3244bb879d0f55caa75657" -> "b29d23f82a3d4b0c86f2d6d93b055c5d"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-web-admin"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "4658499807168081523" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "c56ac582a9af4dad83e20a6b360b9f6a" -> "0fb153d59cdd4520a3c5f2b7ee0096b9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["idam-web-public"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "7021307532572820765" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "58709f1b219849fba58d71009aa91397" -> "75965fba5df744c2b689826abaa2f6ed"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["lau"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "5996510029869608669" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "cfb39ac9b95043958d11183adebeb62f" -> "383ce1808349409da15d53295a1ee332"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["manage-payments"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "2969170163845883686" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "54044681188744409aebeadd49f935b3" -> "90ab0135ba3e4ce78bd942b1b388c648"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["nfdiv-civil-partnership"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "33989922847092046" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "7e78187589c64b50b4f73d0a71f596d1" -> "c4c2a488f92d4144a9167e8aefe25148"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["paybubble"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8536071628361952338" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "6aea74b9e646499281fffa4e5147e761" -> "bc974b5cf49d47d29454b4fdc83b07f8"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["payment-outcome"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "2357210296969560162" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "218b25e1d12b4b9a9af9916d95dd065c" -> "8f668916327a4781a4fa38903cc28835"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["pcq"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "7009727406081562223" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "e36718a5c8a3496ba61376894e0387bc" -> "022cfedd558e4c17a0ef0a085163af4c"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["plum"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "857379128597707240" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "78dbc8f631864cab8f0006dac8d31b9b" -> "fbfc05864a2c414a875e72f671ab4439"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["private-law"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "5390555619920877948" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "bfa4a0af6146404f8e6d43715a75de42" -> "3284d9be28634e0f8e8c7282024840a9"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["probate"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "7971667247517046642" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "ca18f74918cb4808bb9c8f0ce04c0682" -> "daecc72676c7411e9d5b0464553b7f55"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["reformscan"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "4660660241658097252" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "78dbc8f631864cab8f0006dac8d31b9b" -> "fbfc05864a2c414a875e72f671ab4439"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["response"] will be created
  + resource "null_resource" "enable_custom_https_cmd" {
      + id       = (known after apply)
      + triggers = {
          + "certificate_latest_version" = "fbfc05864a2c414a875e72f671ab4439"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["return-case-doc-ccd"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "7296622620345630074" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "c448ac7fc1ad479ba41e8f5229bf8ed0" -> "3a37c778be4140a49012901ca0d661da"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-cor"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "4075325403212235940" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "f17eedc9062049cda5ba5b845de3186f" -> "d3c76d140aa44da98db69761e5a4358b"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-tribunals"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "4286274237080456515" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "ad30544f5ba2438ab8e7541e1db74b10" -> "57f939fda7654e5a84fe852fefe14919"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["sscs-tya"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8101201175427335053" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "013e5ec5529a4d208427f26400a0d66b" -> "2e889a7b5c5342f0896ca936235f6d12"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-approve-org"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "8983118911606522310" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "b0caa5ab4a55420c83f43b33a8dc6be7" -> "371d84041a4640b1beff5989bbfa61bf"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-manage-org"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "2394755876079210891" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "ce5d9d079627448084a7b42d750001f2" -> "c46fdada83334f78a109564e0f8aa7d6"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-register-org"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "6415859790550478759" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "a09377f407ab46ee95b3272c7951737b" -> "e758b4b816e54146a18b24ebd913c35e"
        }
    }

  # module.shutter.null_resource.enable_custom_https_cmd["xui-webapp"] must be replaced
-/+ resource "null_resource" "enable_custom_https_cmd" {
      ~ id       = "4333574239303566534" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "certificate_latest_version" = "d26e9461932845b08290c7d2a54dddfc" -> "f685193ae8484d4ead14244b3a578c58"
        }
    }

Plan: 43 to add, 0 to change, 38 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1612,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->